org/Other/2016-01-22-bookmarks.org
#+OPTIONS: num:nil
#+OPTIONS: ^:nil
#+OPTIONS: H:nil
#+OPTIONS: toc:nil
#+AUTHOR: Zhengchao Xu
#+EMAIL: xuzhengchaojob@gmail.com

#+BEGIN_HTML
---
layout: post
title: Useful links with description
Category: [Life]
---
#+END_HTML
* Links
** 1. Android
*** [[https://github.com/lucasr/twoway-view][twoway-view]]
    一个Android开源库, 该库可以是实现类似"瀑布流"的多行多列效果.
*** [[https://github.com/google/material-design-icons][Material Design Icons]]
    谷歌的Material Design的素材库.
*** [[https://github.com/konifar/android-material-design-icon-generator-plugin][Material Design Icon 添加插件]]
    可以将google 官方的material design 素材库添加到工程中.
*** [[http://developer.android.com/training/permissions/requesting.html][Android 运行时申请权限]]
    6.0开始, 权限申请改到运行时, 这篇官方文档介绍了相关内容.
*** [[http://developer.android.com/about/versions/kitkat.html#44-sms-provider][只有系统程序才可以存储短信]]
    从4.4起, Android只允许默认的短信程序向provider中写入短信.
*** [[http://stackoverflow.com/questions/20542456/view-setbackground-throws-nosuchmethoderror][setBackGround]] 是API16之后(android4.1)才添加
    因此在4.0的机器上会出现NoSuchMethod错误.
** [[https://medium.com/google-developers/intercepting-everything-with-coordinatorlayout-behaviors-8c6adc140c26#.q3rhfxmvn][CoordinatorLayout and Behavior]]
这篇文章对Behavior讲解的很清楚. 
** [[http://nerds.weddingpartyapp.com/tech/2014/12/24/implementing-an-event-bus-with-rxjava-rxbus/][使用RxJava实现event bus]]
