_posts/Other/2016-01-22-bookmarks.html
---
layout: post
title: Useful links with description
Category: [Life]
---
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10">Links</h2>
<div class="outline-text-2" id="text-orgheadline10">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">1. Android</h3>
<div class="outline-text-3" id="text-orgheadline7">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><a href="https://github.com/lucasr/twoway-view">twoway-view</a></h4>
<div class="outline-text-4" id="text-orgheadline1">
<p>
一个Android开源库, 该库可以是实现类似"瀑布流"的多行多列效果.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><a href="https://github.com/google/material-design-icons">Material Design Icons</a></h4>
<div class="outline-text-4" id="text-orgheadline2">
<p>
谷歌的Material Design的素材库.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><a href="https://github.com/konifar/android-material-design-icon-generator-plugin">Material Design Icon 添加插件</a></h4>
<div class="outline-text-4" id="text-orgheadline3">
<p>
可以将google 官方的material design 素材库添加到工程中.
</p>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><a href="http://developer.android.com/training/permissions/requesting.html">Android 运行时申请权限</a></h4>
<div class="outline-text-4" id="text-orgheadline4">
<p>
6.0开始, 权限申请改到运行时, 这篇官方文档介绍了相关内容.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><a href="http://developer.android.com/about/versions/kitkat.html#44-sms-provider">只有系统程序才可以存储短信</a></h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
从4.4起, Android只允许默认的短信程序向provider中写入短信.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><a href="http://stackoverflow.com/questions/20542456/view-setbackground-throws-nosuchmethoderror">setBackGround</a> 是API16之后(android4.1)才添加</h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
因此在4.0的机器上会出现NoSuchMethod错误.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><a href="https://medium.com/google-developers/intercepting-everything-with-coordinatorlayout-behaviors-8c6adc140c26#.q3rhfxmvn">CoordinatorLayout and Behavior</a></h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
这篇文章对Behavior讲解的很清楚. 
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><a href="http://nerds.weddingpartyapp.com/tech/2014/12/24/implementing-an-event-bus-with-rxjava-rxbus/">使用RxJava实现event bus</a></h3>
</div>
</div>
